chtMultiRegion4SEFoam/photovoltaicPanel/system/channel/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform (0 0 0);
        boundaryField
        {
            inlet
            {
                type            fixedValue;
                value           uniform (0.0853 0 0);
            }

            outlet
            {
                type            zeroGradient;
            }

            top
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            bottom
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            frontAndBack
            {
                type            empty;
            }

            channel_to_PV
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 300;
        boundaryField
        {
            inlet
            {
                type            fixedValue;
                value           uniform 300;
            }

            outlet
            {
                type            zeroGradient;
            }

            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            frontAndBack
            {
                type            empty;
            }

            channel_to_PV
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName PV;
                neighbourPatchName PV_to_channel;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 300;
            }
        }
    }

    p
    {
        internalField   uniform 0;

        boundaryField
        {
            inlet
            {
                type            zeroGradient;
            }

            outlet
            {
                type            fixedValue;
                value           uniform 0;
            }

            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            frontAndBack
            {
                type            empty;
            }

            channel_to_PV
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
